[
	{
		"id": "1",
		"title": "Medevice",
		"alt": "Sistema de Gestión de Equipamiento Médico",
		"description": "Sistema backend para la gestión y seguimiento de dispositivos médicos y no médicos. API REST completa, roles, auditoría y pruebas automatizadas.",
		"stack": ["Node.js", "TypeScript", "Express", "Sequelize", "MySQL", "Jest"],
		"problem": "Los hospitales enfrentaban dificultades para rastrear y gestionar miles de dispositivos, resultando en pérdidas y mantenimientos tardíos.",
		"approach": "Arquitectura en capas (Controllers/Services/DAOs/DTOs), autenticación JWT, migraciones y seeds para la BD, API REST con endpoints completos y testing automatizado.",
		"result": "Backend implementado con documentación y tests; procesos de gestión y mantenimiento disponibles via API (métricas internas descriptas en README).",
		"codeUrl": null,
		"demoUrl": null,
		"image": "https://images.unsplash.com/photo-1517245386807-bb43f82c33c4?w=600&h=400&fit=crop",
		"featured": true,
		"type": "backend",
		"readme": "/readmes/readme_project_1.md",
		"visibility": "private"
	},
	{
		"id": "2",
		"title": "Isla Gourmet — Sitio Corporativo (maquetado)",
		"alt": "Isla Gourmet - catering y eventos",
		"description": "Sitio estático corporativo para una empresa ficticia de catering (Isla Gourmet). Maquetado en HTML con SASS y diseñado usando Bootstrap; incluye secciones de servicios, galería y contacto.",
		"stack": ["HTML", "Sass", "Bootstrap"],
		"problem": "Necesidad de un sitio informativo y visualmente atractivo para presentar servicios de catering y captar clientes.",
		"approach": "Maquetación responsive con HTML y SASS; componentes y layout apoyados por Bootstrap; deployment estático en Netlify.",
		"result": "Sitio estático, responsive y estético desplegado en Netlify. Buen punto visual para portfolio y demostración de habilidades de maquetado.",
		"codeUrl": "https://github.com/Coriannder/proyectoFinal-dw",
		"demoUrl": "https://islagourmet.netlify.app/index.html",
		"image": "https://islagourmet.netlify.app/fuentes/comidaIndex2.jpg",
		"featured": false,
		"type": "frontend",
		"readme": null,
		"visibility": "public"
	},
	{
		"id": "3",
		"title": "Charada Rental - Alquiler de Utilería Audiovisual",
		"alt": "Plataforma de alquiler de utilería para producciones audiovisuales",
		"description": "Sitio web para alquiler de utilería audiovisual. Incluye catálogo completo de productos organizados por categorías, visualizador de imágenes y formulario de contacto integrado.",
		"stack": ["React", "TypeScript", "Tailwind CSS", "Framer Motion", "Cloudinary", "React Router"],
		"problem": "Productoras audiovisuales necesitaban una forma eficiente de explorar y alquilar utilería para sus producciones.",
		"approach": "Desarrollé una SPA con React y TypeScript, implementando un catálogo dinámico con filtros por categoría, carrusel de imágenes optimizadas con Cloudinary y formulario de contacto conectado a backend.",
		"result": "Plataforma funcional con diseño responsivo, navegación fluida y gestión optimizada de imágenes que facilita la búsqueda y alquiler de utilería.",
		"codeUrl": null,
		"demoUrl": "https://charada-rental.sebasdev.com/home",
		"image": "/src/assets/charada-img-id3.png",
		"featured": true,
		"type": "fullstack",
		"readme": "/readmes/readme_project_3.md",
		"visibility": "private"
	},
	{
		"id": "4",
		"title": "Adrian Albarracin - Portfolio Chef Pastelero",
		"alt": "Portfolio profesional de chef pastelero",
		"description": "Sitio web portfolio para chef pastelero con experiencia internacional. Incluye galería de creaciones, información profesional, experiencia culinaria y formulario de contacto.",
		"stack": ["HTML", "CSS", "JavaScript"],
		"problem": "Chef pastelero necesitaba una presencia web profesional para mostrar su trabajo, experiencia internacional y atraer clientes en el sector gastronómico.",
		"approach": "Desarrollé un portfolio visualmente atractivo implementando una galería de imágenes optimizada, secciones de presentación profesional y diseño elegante que refleja la sofisticación de la pastelería artesanal.",
		"result": "Sitio web profesional desplegado que destaca la experiencia del chef, sus creaciones y facilita el contacto con potenciales clientes.",
		"codeUrl": null,
		"demoUrl": "https://adrianalbarracin.sebasdev.com/",
		"image": "https://images.unsplash.com/photo-1578985545062-69928b1d9587?w=600&h=400&fit=crop",
		"featured": false,
		"type": "frontend",
		"readme": null,
		"visibility": "private"
	}
]